app/views/users/show.html.erb

SELECT 1 AS one FROM "posts" WHERE (author_id = 19) LIMIT $1  [["LIMIT", 1]]
---
    <div class="user-posts-wrapper">
      <% render "nopost" if @user_posts.empty? %>