app/views/posts/index.html.erb

          <h3 class="intermediate-heading">Comments</h3>
          <% if post.last_5_comment.empty? %>
---
SELECT 1 AS one FROM "comments" WHERE "comments"."post_id" = $1 LIMIT $2  [["post_id", 2], ["LIMIT", 1]]