app/views/posts/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" DESC LIMIT $2  [["post_id", 17], ["LIMIT", 5]]
---

          <% post.last_5_comment.each do |comment|%>