app/views/posts/show.html.erb

        <small> <%= no_comment %> </small>
        <% @post.last_5_comment.each do |comment|%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" DESC LIMIT $2  [["post_id", 2], ["LIMIT", 5]]