app/controllers/comments_controller.rb

  def create
    @comment = current_user.comments.new(comment_params)
    @post = Post.find(params[:comment][:post_id])

    if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("author_id", "post_id", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 1], ["post_id", 1], ["text", "asddfsdfsdf"], ["created_at", "2022-04-08 20:20:46.814881"], ["updated_at", "2022-04-08 20:20:46.814881"]]