app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" IN ($1, $2, $3)  [["post_id", 1], ["post_id", 2], ["post_id", 3]]
SELECT "posts".* FROM "posts" WHERE (author_id = 11) ORDER BY "posts"."created_at" DESC LIMIT $1  [["LIMIT", 3]]
SELECT "comments".* FROM "comments" WHERE (post_id = 17) ORDER BY "comments"."created_at" DESC LIMIT $1  [["LIMIT", 5]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @user = User.find(params[:user_id])
    @user_posts = User.last_3_posts(params[:user_id])
    @posts = @user.posts.includes(:comments, :likes)

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 11]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 11]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 5]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 5]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def show
    @post = Post.includes(:comments, :likes).find(params[:id])
    @comments = @post.comments.includes(:author)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 7]]
UPDATE "users" SET "posts_counter" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["posts_counter", 2], ["updated_at", "2022-04-15 10:06:40.229299"], ["id", 2]]
---
  def destroy
    @post = Post.find(params[:id])
    @user = User.find(params[:user_id])
    @user.posts_counter -= 1
    @post.destroy!
    @user.save

INSERT INTO "posts" ("author_id", "title", "text", "created_at", "updated_at", "like_counter", "comments_counter") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["author_id", 2], ["title", "dfgdg"], ["text", "fdgdfgdf"], ["created_at", "2022-04-14 13:27:38.379555"], ["updated_at", "2022-04-14 13:27:38.379555"], ["like_counter", 0], ["comments_counter", 0]]
---
  def create
    post = current_user.posts.new(post_params)

    if post.save