app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT name, photo, posts_counter FROM "users"